#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_ecs_cluster.ecs_cluster: Refreshing state... [id=arn:aws:ecs:us-east-1:369168831564:cluster/ecs-cluster]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-01fff0957ca47e89f]
data.aws_availability_zones.available: Reading...
aws_apigatewayv2_api.apigw_http_endpoint: Refreshing state... [id=kkl2hjkul9]
aws_ecs_cluster_capacity_providers.example: Refreshing state... [id=ecs-cluster]
aws_apigatewayv2_stage.apigw_stage: Refreshing state... [id=$default]
data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]
aws_security_group.ecs_security_group: Refreshing state... [id=sg-029d6619b5d312fc5]
aws_security_group.lb_security_group: Refreshing state... [id=sg-0f80f6de7b9dc4d7a]
module.vpc.aws_route_table.private[2]: Refreshing state... [id=rtb-02f3a7b404fe60aef]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-037de480b5563395e]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0445888f30e75c23f]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0055f9b92420f0255]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0a5e0f4aef71171f7]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0c490266581cf60ea]
aws_security_group_rule.sg_ingress_rule_ecs_cluster_from_lb: Refreshing state... [id=sgrule-1438586603]
aws_security_group_rule.sg_ingress_rule_all_to_lb: Refreshing state... [id=sgrule-545846465]
aws_security_group_rule.sg_egress_rule_lb_to_ecs_cluster: Refreshing state... [id=sgrule-3662990362]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-01895e9280a516fa5]
aws_apigatewayv2_vpc_link.vpclink_apigw_to_alb: Refreshing state... [id=dzo61c]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-072b6968bf97eee88]
aws_lb.ecs_alb: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:369168831564:loadbalancer/app/tf-lb-20230111180151339500000004/ccd1a360c78d599d]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0fcfdf047bb0be1b5]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_ecs_cluster.ecs_cluster will be destroyed
  # (because aws_ecs_cluster.ecs_cluster is not in configuration)
  - resource "aws_ecs_cluster" "ecs_cluster" {
      - arn                = "arn:aws:ecs:us-east-1:369168831564:cluster/ecs-cluster" -> null
      - capacity_providers = [
          - "FARGATE",
        ] -> null
      - id                 = "arn:aws:ecs:us-east-1:369168831564:cluster/ecs-cluster" -> null
      - name               = "ecs-cluster" -> null
      - tags               = {
          - "environment" = "dev"
          - "workload"    = "workload1"
        } -> null
      - tags_all           = {
          - "environment" = "dev"
          - "workload"    = "workload1"
        } -> null

      - default_capacity_provider_strategy {
          - base              = 0 -> null
          - capacity_provider = "FARGATE" -> null
          - weight            = 100 -> null
        }

      - setting {
          - name  = "containerInsights" -> null
          - value = "disabled" -> null
        }
    }

  # aws_ecs_cluster_capacity_providers.example will be destroyed
  # (because aws_ecs_cluster_capacity_providers.example is not in configuration)
  - resource "aws_ecs_cluster_capacity_providers" "example" {
      - capacity_providers = [
          - "FARGATE",
        ] -> null
      - cluster_name       = "ecs-cluster" -> null
      - id                 = "ecs-cluster" -> null

      - default_capacity_provider_strategy {
          - base              = 0 -> null
          - capacity_provider = "FARGATE" -> null
          - weight            = 100 -> null
        }
    }

  # module.ecs.aws_ecs_cluster.this[0] will be created
  + resource "aws_ecs_cluster" "this" {
      + arn                = (known after apply)
      + capacity_providers = (known after apply)
      + id                 = (known after apply)
      + name               = "ecs-fargate"
      + tags               = {
          + "environment" = "dev"
          + "workload"    = "workload1"
        }
      + tags_all           = {
          + "environment" = "dev"
          + "workload"    = "workload1"
        }

      + configuration {
          + execute_command_configuration {
              + logging = "DEFAULT"
            }
        }

      + default_capacity_provider_strategy {
          + base              = (known after apply)
          + capacity_provider = (known after apply)
          + weight            = (known after apply)
        }

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # module.ecs.aws_ecs_cluster_capacity_providers.this[0] will be created
  + resource "aws_ecs_cluster_capacity_providers" "this" {
      + capacity_providers = [
          + "FARGATE_SPOT",
        ]
      + cluster_name       = "ecs-fargate"
      + id                 = (known after apply)

      + default_capacity_provider_strategy {
          + base              = 0
          + capacity_provider = "FARGATE_SPOT"
          + weight            = 100
        }
    }

  # module.vpc.aws_route_table.private[0] will be updated in-place
  ~ resource "aws_route_table" "private" {
        id               = "rtb-0445888f30e75c23f"
      ~ tags             = {
          ~ "Name"        = "workload1-private-us-east-1a" -> "workload1-vpc-private-us-east-1a"
            # (2 unchanged elements hidden)
        }
      ~ tags_all         = {
          ~ "Name"        = "workload1-private-us-east-1a" -> "workload1-vpc-private-us-east-1a"
            # (2 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.private[1] will be updated in-place
  ~ resource "aws_route_table" "private" {
        id               = "rtb-0055f9b92420f0255"
      ~ tags             = {
          ~ "Name"        = "workload1-private-us-east-1b" -> "workload1-vpc-private-us-east-1b"
            # (2 unchanged elements hidden)
        }
      ~ tags_all         = {
          ~ "Name"        = "workload1-private-us-east-1b" -> "workload1-vpc-private-us-east-1b"
            # (2 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.private[2] will be updated in-place
  ~ resource "aws_route_table" "private" {
        id               = "rtb-02f3a7b404fe60aef"
      ~ tags             = {
          ~ "Name"        = "workload1-private-us-east-1c" -> "workload1-vpc-private-us-east-1c"
            # (2 unchanged elements hidden)
        }
      ~ tags_all         = {
          ~ "Name"        = "workload1-private-us-east-1c" -> "workload1-vpc-private-us-east-1c"
            # (2 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.private[0] will be updated in-place
  ~ resource "aws_subnet" "private" {
        id                                             = "subnet-0a5e0f4aef71171f7"
      ~ tags                                           = {
          ~ "Name"        = "workload1-private-us-east-1a" -> "workload1-vpc-private-us-east-1a"
            # (2 unchanged elements hidden)
        }
      ~ tags_all                                       = {
          ~ "Name"        = "workload1-private-us-east-1a" -> "workload1-vpc-private-us-east-1a"
            # (2 unchanged elements hidden)
        }
        # (14 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.private[1] will be updated in-place
  ~ resource "aws_subnet" "private" {
        id                                             = "subnet-0c490266581cf60ea"
      ~ tags                                           = {
          ~ "Name"        = "workload1-private-us-east-1b" -> "workload1-vpc-private-us-east-1b"
            # (2 unchanged elements hidden)
        }
      ~ tags_all                                       = {
          ~ "Name"        = "workload1-private-us-east-1b" -> "workload1-vpc-private-us-east-1b"
            # (2 unchanged elements hidden)
        }
        # (14 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.private[2] will be updated in-place
  ~ resource "aws_subnet" "private" {
        id                                             = "subnet-037de480b5563395e"
      ~ tags                                           = {
          ~ "Name"        = "workload1-private-us-east-1c" -> "workload1-vpc-private-us-east-1c"
            # (2 unchanged elements hidden)
        }
      ~ tags_all                                       = {
          ~ "Name"        = "workload1-private-us-east-1c" -> "workload1-vpc-private-us-east-1c"
            # (2 unchanged elements hidden)
        }
        # (14 unchanged attributes hidden)
    }

  # module.vpc.aws_vpc.this[0] will be updated in-place
  ~ resource "aws_vpc" "this" {
        id                                   = "vpc-01fff0957ca47e89f"
      ~ tags                                 = {
          ~ "Name"        = "workload1" -> "workload1-vpc"
            # (2 unchanged elements hidden)
        }
      ~ tags_all                             = {
          ~ "Name"        = "workload1" -> "workload1-vpc"
            # (2 unchanged elements hidden)
        }
        # (16 unchanged attributes hidden)
    }

Plan: 2 to add, 7 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf_plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf_plan"

```

</details>

*Pusher: @liamfit, Action: `pull_request`, Workflow: `Terraform`*